// Написать программу, 
// которая из имеющегося массива строк формирует массив из строк, 
// длина которых меньше либо равна 3 символа. 
// Первоначальный массив можно ввести с клавиатуры, 
// либо задать на старте выполнения алгоритма. 
// При решении не рекомендуется пользоваться коллекциями, 
// лучше обойтись исключительно массивами.
 
// Задаем массив
string[] massive = { "asldkfj", "Yes", "Thanks", "14314", "24", "%$(%", "$" };
 int j = 0;

// Создаем новый массив из элементов, число символов которых равно или менее 3
 string[] rezult = new string[massive.Length];
 for (int i = 0; i < massive.Length; i++)
    if (massive[i].Length <= 3) rezult[j++] = massive[i];

PrintRezult(rezult);

// Печать результата
void PrintRezult(string[] rez)
{
     Console.WriteLine($"В итоге мы получили массив из {j} элементов:");
    for (int k = 0; k < rez.Length; k++)
        Console.Write($"{rez[k]} ");
}
